<template>
  <view>
    <view class="container" v-if="type === 'questions'">
      <view class="qa-item" v-for="(item, index) in qaList" :key="index">
        <view class="question">{{ item.question }}</view>
        <view class="answer" v-for="item1 in item.answers">{{ item1 }}</view>
      </view>
    </view>
    <view class="container" v-else-if="type === 'customer'">
      <text>
        如果您有任何关于我们的EAP听感分析仪应用的疑问、建议或需要帮助，我们的客服团队随时为您提供支持和解答。请随时通过以下方式联系我们：

        客服邮箱：support@eapanalysis.com
        客服电话：+123-456-7890（周一至周五，上午9点至下午5点）
        我们珍视您的反馈，致力于为您提供最好的服务体验。不论您遇到任何问题或需求，都请毫不犹豫地与我们联系。期待为您提供帮助！
      </text>
    </view>
    <view class="container" v-else-if="type === 'about'">
      <text>
        EAP听感分析仪是一款基于ACT接纳承诺疗法的心理状态评估工具，旨在帮助您全面了解自己的心理状态和心灵灵活度。通过六个核心维度的评估，您可以深入探索自我接纳度、思想偏执度以及情感意识度、价值导向度、自我觉察度和关系灵活性，从而更好地认识自己、指导行为，并提升心理灵活性。


        同时，第一阶段主要选择的是员工思想状态中的两个较为重要的维度：
        自我接纳度（对内）和思想偏执度（对外）——自我接纳度主要关注个体对内接纳自我、不伤害自我的能力，而思想偏执度则关注个体对外认同社会他人，不走极端不伤害他人的程度。
        <b>即“自我接纳度”衡量员工不伤害自我的程度；“思想偏执度”衡量员工不伤害他人的程度。</b>

        全面评估员工的心理灵活性状态的完整六个维度为：

      </text>
      <table class="custom-table">
        <tbody>
        <tr v-for="(person, index) in people" :key="person.id">
          <td style="width: 20px" v-if="index === 0" :rowspan="index === 0 ? people.length : 1"><b>{{ person.name }}</b></td>
          <td style="width: 120px"><b>{{ person.age }}</b></td>
          <td>{{ person.city }}</td>
        </tr>
        </tbody>
      </table>
      <text>
        <br>
        <br>


        EAP听感分析仪特色功能:

        全面评估: 基于六个关键维度的评估，帮助您全面了解自己的心理状态。
        个性化建议: 根据评估结果，为您提供个性化的心理发展建议和行为指导。
        进步追踪: 记录您的心理灵活度评估历史，帮助您追踪心理成长和进步。
        提升指导: 提供心理健康小工具和练习，助您提升心理灵活性和心理健康水平
        数据安全: 严格保护您的个人数据隐私，确保评估结果安全可靠。

      </text>
    </view>
    <image src="/static/index-bottom-mountain.png" class="bottom-mountain"></image>
  </view>
</template>

<script>
	export default {
		data() {
			return {
        qaList: [
          {
            question: '什么是EAP听感分析仪？',
            answers: ['EAP听感分析仪是一种基于接纳承诺疗法的心理状态评估工具，旨在帮助评估员工的心理状态和心理灵活性。', '这个仪器的主要功能是，通过高科技的手段，转化员工在谈心谈话时的语音信息为可供分析的数据，从而深入了解其心理状态。它通过评估员工在ACT接纳承诺疗法六边形模型的六个关于心理灵活性的不同维度上的表现，包括自我接纳度、思想偏执度、情感意识度、价值导向度、自我觉察度和关系灵活性，以提供全面的心理评估。\n', '听感分析仪将为党支部领导提供高效科学的心理测评手段，以更为精准地了解员工的心理状态，进一步推进“大健康”人文关怀理念在实际工作中的应用。\n']
          },
          {
            question: '为什么需要使用EAP听感分析仪？',
            answers: ['EAP听感分析仪可以帮助员工和管理者更好地了解员工的心理状态和心理灵活性水平。通过这种评估工具，可以更方便、更及时地发现员工可能存在的心理健康问题或压力源，从而提供更好的支持和帮助，促进员工的心理健康和工作表现。',
            '对于党组织而言，这个仪器的价值在于：',
                '①　提高沟通效果：在党组织与员工之间，沟通是最重要的一环。听感分析仪的存在，可以有效提升党支部领导与员工之间的沟通效果，使得领导更能理解员工的心境，同时也增强了党组织的凝聚力。',
                '②　科学心理分析：通过该仪器，党支部领导可以得到一个更为科学、客观的心理分析报告，这为领导提供了更为准确的指导方针，有针对性地解决员工的心理问题。',
                '③　维护内部氛围：员工的心理健康是公司稳定发展的关键。通过听感分析仪，可以及时发现员工的心理问题，有效地降低心理风险，从而维护了党组织的稳定和和谐氛围。',
                'EAP听感分析仪的推广应用，将有助于提高党支部领导与员工的沟通效果，增强党组织凝聚力。通过科学的心理分析，党支部领导可以更好地了解员工的心理状态，针对性地解决问题，维护党组织稳定和谐。在一定程度上，本项目将促进党组织建设水平的提高，提升员工的满意度和归属感。'
            ]
          },
          {
            question: '如何使用EAP听感分析仪？',
            answers: ['使用EAP听感分析仪时，通常需要思政工作者与员工完成一系列沟通交流，设备会提供一系列半封闭式的提问引导，思政工作者具体只需要在交流前打开本设备的录制功能即可。后台AI算法将自动识别两人的交流语音文字与语音语调特征进行分析，评估员工在各个维度上的表现，并生成相应的心理状态分析与EAP工作辅助方案报告。这些报告可以用于员工个人自我认知、心理健康促进，也可以作为管理者提供支持和指导员工的依据。']
          },
          {
            question: 'EAP听感分析仪的评估结果如何解读？',
            answers: ['评估结果将根据员工在各个维度上的得分来进行解读，除了心理学专业性上的解答以外，也包括了心理咨询师对结果的分析与“白话翻译”，直接阅读咨询师建议亦可。思政工作者可以根据评估结果与建议，了解员工在不同方面的表现，从而有针对性地改善员工的心理健康状态或利用好相对应的EAP工作辅助方案。']
          },
          {
            question: 'EAP听感分析仪如何帮助改善员工的心理健康？',
            answers: ['通过定期使用EAP听感分析仪评估员工的心理状态，可以及时发现和解决员工可能存在的心理健康问题，提供个性化的心理支持和建议。ACT接纳承诺疗法六边形模型针对的是非病理性的心理灵活性问题，属于“未病”预防部分，可以把严重心理问题防患于未然，也可以降低思政工作者与员工交谈时员工的防御阻抗心理，这将有助于员工更好地应对工作压力、提升情绪管理能力，促进心理健康和整体幸福感。',
            '未来，我们将继续关注员工心理健康领域的发展动态，以满足党支部领导与员工的需求为导向，不断优化和完善产品功能。我们将针对新的技术发展趋势，进行产品升级，提高心理分析的准确性与效率。同时，我们将加强人员培训与教育，确保党支部领导能充分利用本产品，提升与员工沟通效果，为党组织稳定和谐发展贡献力量。']
          }
          // 可以继续添加更多问题和答案
        ],
        type: '',
        people: [
          {name: '心理灵活性\n' +
                'A\n' +
                'C\n' +
                'T\n' +
                '六边形模型\n', age: '1.\t自我接纳度\n' +
                '（经验性回避）\n', city: '指的是人们试图控制或改变自身内在经验（如想法、情绪、躯体感觉或记忆等）在脑海中出现的形式、频率，或对情境的敏感性。' },
          {age: '2.\t思想偏执度\n' +
                '（认知融合）\n', city: '指的是人类行为受限于思维内容的倾向。该倾向使人们的行为受语言规则和认知评价的过度控制，从而无法用此时此地的经验和直接的经验指导行为。' },
          {age: '3.\t情感意识度\n' +
                '（现在意识）\n', city: '这一维度强调个体对当前情境中情感和体验的全面意识。它涉及对即时经验的注意力和敏感性，包括对环境、身体感觉、情绪和思维的觉察。情感意识度高的个体能够清晰地识别和接受他们的感受，而不是回避或淡化它们。' },
          {age: '4.\t价值导向度\n' +
                '（承诺行动）\n', city: '价值导向度指的是个体根据其核心价值观来指导行为的程度。这包括认识和明确个人的价值观，以及根据这些价值观采取具体行动。高价值导向度的个体能够在日常生活中持续地采取与其价值观一致的行动。' },
          {age: '5.\t自我觉察度\n' +
                '（自我观察）\n', city: '这一维度强调个体对自己内在心理状态的觉察和理解。它涉及自我反思和自我意识，包括理解自己的思维模式、情感反应和行为习惯。具有高自我觉察度的个体能够更好地理解自己的内心世界，并据此做出更明智的选择。' },
          {age: '6.\t关系灵活性\n' +
                '（关系框架）\n', city: '关系灵活性关注个体在人际关系中的适应性和灵活性。它涉及识别和调整在人际互动中的角色和行为，以及在维持积极、健康关系方面的能力。具备高关系灵活性的个体能够在不同的社交情境中灵活调整自己的行为，以促进有效和和谐的人际交往。' },
        ]
			}
		},
    onLoad(options) {
      const type = options.type
      switch (type) {
        case 'questions': {
          uni.setNavigationBarTitle({
            title: '常见问题解答'
          })
          break
        }
        case 'about': {
          uni.setNavigationBarTitle({
            title: '关于'
          })
        }
      }
      this.type = options.type

    },
		methods: {
			
		}
	}
</script>

<style>
.bottom-mountain {
  position: fixed;
  bottom: 0;
  width: 700rpx;
  height: 272rpx;
  opacity: 0.2;
}
.container {
  padding: 40rpx;
}

.qa-item {
  margin-bottom: 20rpx;
}

.question {
  font-weight: bold;
}

.answer {
  margin-top: 10rpx;
}

.custom-table {
  border-collapse: collapse;
}

.custom-table th, .custom-table td {
  border: 1px solid black;
  padding: 8px;
}
</style>
